# Δημιουργήστε μια λίστα με 10 αριθμούς [18, 92, 75, 44, 70, 56, 40, 33, 41, 68, 49, 28] που αφορούν του βαθμούς κάποιων φοιτητών. Γράψτε τις κατάλληλες εντολές  Python για τα παρακάτω: 
# a.	Αλλάξτε το 2ο βαθμό από 92 σε 72.
# b.	Βρείτε τους βαθμούς που είναι μικρότεροι του 40 και δημιουργήστε μια νέα λίστα με αυτούς.
# c.	Τυπώστε τη λίστα ταξινομημένη.
# d.	Ζητήστε έναν αριθμό από το χρήστη και βρείτε αν ο αριθμός υπάρχει στη λίστα. Αν υπάρχει, βρείτε τη θέση της λίστας στην οποία βρίσκεται. 

data = [18, 92, 75, 44, 70, 56, 40, 33, 41, 68, 49, 28]

# a
data[1] = 72

# b
less_than_40 = []
for value in data:
    if value < 40:
        less_than_40.append(value)
print(less_than_40)

# c
print(sorted(data))

# d
n = int(input("Give a number: "))
if n in data:
    print(data.index(n))
else:
    print(n, "Not found")